networking/examples/tsung_websocket.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd" >
<tsung loglevel="notice" version="1.0">
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="1000" />
  </clients>

  <servers>
    <server host="server_1" port="4000" type="tcp" />
  </servers>

  <load>
    <arrivalphase phase="1" duration="120" unit="second">
      <users maxnumber="100" arrivalrate="1" unit="second" />
    </arrivalphase>
  </load>

  <sessions>
    <session name="user-online" probability="100" type="ts_http">
      <request subst="true">
        <dyn_variable name="token" header="x-token"/>
        <http url="/user/%%ts_user_server:get_unique_id%%"></http>
      </request>

      <change_type new_type="ts_websocket" host="server_1" port="4000" server_type="tcp" bidi="true" />

      <request subst="true">
        <websocket type="connect" path="/socket/websocket?token=%%_token%%"></websocket>
      </request>

      <request subst="true">
        <websocket type="message" frame="text">{"topic":"user:%%ts_user_server:get_unique_id%%", "event":"phx_join", "payload":{}, "ref":"1"}</websocket>
      </request>

      <for var="heartbeat" from="1" to="1000" incr="1">
        <thinktime value="30"/>
      </for>
    </session>
  </sessions>
</tsung>